In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data_for_tableau.csv')

In [13]:
df.head()

,date,event,purchase_sum,os_name,device_id,gender,city,utm_source
0,2020-01-01,app_start,NaN,android,669460,female,Moscow,-
1,2020-01-01,app_start,NaN,ios,833621,male,Moscow,vk_ads
2,2020-01-01,app_start,NaN,android,1579237,male,Saint-Petersburg,referal
3,2020-01-01,app_start,NaN,android,1737182,female,Moscow,facebook_ads
4,2020-01-01,app_start,NaN,ios,4029024,female,Moscow,facebook_ads

In [16]:
df.shape[0]

2747968

In [14]:
df['date'].min()

'2020-01-01'

In [15]:
df['date'].max()

'2020-03-31'

In [18]:
# для каждого пользователя отбираем первое событие, для чего сортируем по дате и удаляем дубли

min_date=df.sort_values('date').drop_duplicates('device_id')

In [20]:
min_date.head()

,date,event,purchase_sum,os_name,device_id,gender,city,utm_source
0,2020-01-01,app_start,NaN,android,669460,female,Moscow,-
13192,2020-01-01,tap_basket,NaN,android,17289661,male,Saint-Petersburg,vk_ads
13191,2020-01-01,tap_basket,NaN,android,12215118,male,Saint-Petersburg,facebook_ads
13190,2020-01-01,tap_basket,NaN,ios,9163079,male,Moscow,vk_ads
13189,2020-01-01,tap_basket,NaN,android,1948894,female,Saint-Petersburg,google_ads

In [21]:
# отбираем только нужные колонки для разбиения на когорты по первой сессии
min_date = min_date[['device_id', 'date']]

In [22]:
min_date.head()

       device_id        date
0         669460  2020-01-01
13192   17289661  2020-01-01
13191   12215118  2020-01-01
13190    9163079  2020-01-01
13189    1948894  2020-01-01

In [23]:
 min_date = min_date.rename(columns = {'date':'Когорта по первой сессии'})

In [ ]:
# объединяем датасеты df и min_date, чтобы видеть, к какой когорте по первой сессии наши пользователи принадлежат

In [24]:
df = df.merge(min_date, how = 'left', on = 'device_id')

In [27]:
df.head()

,date,event,purchase_sum,os_name,device_id,gender,city,utm_source,Когорта по первой сессии
0,2020-01-01,app_start,NaN,android,669460,female,Moscow,-,2020-01-01
1,2020-01-01,app_start,NaN,ios,833621,male,Moscow,vk_ads,2020-01-01
2,2020-01-01,app_start,NaN,android,1579237,male,Saint-Petersburg,referal,2020-01-01
3,2020-01-01,app_start,NaN,android,1737182,female,Moscow,facebook_ads,2020-01-01
4,2020-01-01,app_start,NaN,ios,4029024,female,Moscow,facebook_ads,2020-01-01

In [26]:
# итоговый датасат сохряняем в формате csv для дальнейшего анализа в Tableau
df.to_csv('data_to_analysis.csv', index = False)